<template>
	<div class="description">
		<h3>Описание проекта</h3>
		<p>Проект представляет из себя 3 слоя:
			<ul>
				<ol>1 - интерфейс, который отображает данные и взаимодействует со слоем данных. Состоит из самостоятельного модуля, который состоит из компонентов, чтобы не перегружать его содержимое </ol>
				<ol>2 - хранилище данных, которое содержит данные и методы их изменения. Оно взаимодействует со слоями интерфейса и API</ol>
				<ol>3 - API слой для взаимодействия с сервером. Отвечает за подключение и отключение websocket канала и обработку входящих сообщений</ol>
			</ul>
			Слой общих UI компонентов я реализовывать не стал, потому что проект маленький и они не повторяются
		</p>
		<h3>Реализация задания:</h3>
		<ul>
			<li>Подключится к сервису ws://test.enter-systems.ru/ - реализовано</li>
			<li>Выполнить авторизацию логин enter, пароль A505a - реализовано</li>
			<li>Подписаться на инкрементную подписку (логов приложения) - реализовано</li>
			<li>Отобразить логи (Данных может быть много) - реализовано</li>
				<ul>
					<li>Дизайн произвольный (Использование UI библиотек не воспрещается)
				Ожидается, интерфейс будет имитировать, как будто мы смотрим файл - реализовано</li>
					<li>Функциональные возможности:
						<ul>
							<li>Переключение уровня логов (отфильтрованные данные не отображаются) - реализовано</li>
							<li>Текстовый поиск не отфильтровывает, а именно подсвечивает, и предоставляет кнопки навигации к следующему найденному тексту, по подобию как это делает браузер - реализовано, но есть баг, который заключается в том, что после изменения содержимого блока логов через innerHTML vue динамически не отрисовывает логику блока. Решается через применение на блоке директивы v-html и генерацию его содержимого через функционал чистого js. Не стал переписывать, потому что описанная задача решается поиском браузера.</li>
							<li>Так как, возвращаемых данных может быть, много, реализация виртуального скрола, и стараемся рендерить только, что видим - не реализовано по причине не реализованного предыдущего условия</li>
							<li>Интенсивность, потока новых сообщений, может быть как большой, так и маленькой. Предусмотреть, адекватное поведение - не реализовано. Для реализации адекватного поведения нужно, чтобы при нахождении внизу блока со списком логов новые логи добавлялилсь с прокруткой блока вниз, в других положениях скролла он смещаться не должен. Сложно тестировать без прихода новых данных с сервера</li>
							<li>Любые улучшения на ваш взгляд приветствуются (даже если их не сделаете, а просто опишите, что можно ещё улучшить, и как. Тоже приветствуется) - возможные улучшения сервиса: реализация фильтра по дате и времени, перемотки в начало и конец фильтра, реализация кнопки подключения/отключения логов</li>
						</ul>
					</li>

				</ul>

		</ul>



                                                              
	</div>
</template>

<script setup lang="ts">

</script>


<style scoped lang="sass">
@import '@/assets/styles/constants.sass'

.description
	padding: 16rem 32rem
</style>





